Catalogs/Д_Должности.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.14">
	<Catalog>
		<Properties>
			<Name>Д_Должности</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Нередактируемая</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДолжностнаяРоль</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ОсновныеДолжностиПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидУчета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

InformationRegisters/ПроверкаОбъектовБД.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<InformationRegister>
		<Properties>
			<Name>ПроверкаОбъектовБД</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Проверен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусПриПроверкеОбъектовБД</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Д_Должности</v8:Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ТипыПроверяемыхСправочников.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Enum>
		<Properties>
			<Name>ТипыПроверяемыхСправочников</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Номенклатура</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Контрагенты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Должности</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Организации</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/Д_Должности/Ext/ObjectModule.bsl
Процедура ПередЗаписью(Отказ)
		
	Если Не Отказ Тогда
		Если Не ЗначениеЗаполнено(Ссылка) Тогда
			ЭтотОбъект.ДополнительныеСвойства.Вставить("ЭтоНовый");
		Иначе
			СсылкаНаИсточник		= ЭтотОбъект.Ссылка;
			Источник 				= ЭтотОбъект;
			МетаданныеИсточника = Источник.Метаданные();
			
			БылоИзменение = Ложь;
			
			Для Каждого Реквизит Из МетаданныеИсточника.Реквизиты Цикл
				ИмяРеквизита = Реквизит.Имя;
				Если Не СсылкаНаИсточник[ИмяРеквизита] = Источник[ИмяРеквизита] Тогда
					БылоИзменение = Истина;
					Продолжить;
				КонецЕсли;
			КонецЦикла;
			
			Если Не БылоИзменение Тогда
				Для Каждого Реквизит Из МетаданныеИсточника.СтандартныеРеквизиты Цикл
					ИмяРеквизита = Реквизит.Имя;
					Если Не СсылкаНаИсточник[ИмяРеквизита] = Источник[ИмяРеквизита] Тогда
						БылоИзменение = Истина;
						Продолжить;
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
			
			Если БылоИзменение Тогда
				ЭтотОбъект.ДополнительныеСвойства.Вставить("ЭтоНовый");
			КонецЕсли;
			
		КонецЕсли;
	КонецЕсли;
	
	//подписка на событие
	БюджетныйНаСервере.ПередЗаписиЭлементовСправочниковПриЗаписи(ЭтотОбъект, Отказ);
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	//Если ЗначениеЗаполнено(Ссылка.Родитель) Тогда 
	//	Если (Ссылка.Родитель = Справочники.Д_Должности.ДолжностиКадровогоУчета Или Ссылка.Родитель.ПринадлежитЭлементу(Справочники.Д_Должности.ДолжностиКадровогоУчета))
	//		И Не (РольДоступна("Кадровик") Или РольДоступна("Администратор")) Тогда
	//		Сообщить("В папке ""Должности кадрового учета"" изменять/создавать элементы может только кадровик");
	//		Отказ = Истина;
	//	КонецЕсли;	
	//КонецЕсли;
	
	Ответственный = ОбщегоНазначения.ПолучитьОтветственногоЗаСправочник(Перечисления.ТипыПроверяемыхСправочников.Должности);
	
	Если ЗначениеЗаполнено(Ответственный) И ЭтотОбъект.ДополнительныеСвойства.Свойство("ЭтоНовый")	Тогда
		НаборЗаписей = РегистрыСведений.ПроверкаОбъектовБД.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Объект.Установить(Ссылка);
		НаборЗаписей.Прочитать();
		НаборЗаписей.Очистить();
		Запись 				= НаборЗаписей.Добавить();
		Запись.Объект	 	= Ссылка;
		Запись.Проверен 	= Ложь;
		НаборЗаписей.Записать();
		ЭтотОбъект.ДополнительныеСвойства.Удалить("ЭтоНовый");
		Задача = Задачи.Задача.СоздатьЭлемент();
		Задача.Заявка = Ссылка;
		Задача.Дата = ТекущаяДата();
		Задача.Наименование = "Согласовать создание/изменение должности";
		Задача.Автор = ПараметрыСеанса.ТекущийПользователь;
		Задача.Описание = "Необходимо согласовать созданную/измененную должность";
		Задача.Исполнитель = Ответственный;
		Задача.Записать();
		//БПСервер.СоздатьОповещение(Константы.ОтветственныйЗаСправочникДолжностей.Получить(), "Был создан/изменен элемент справочника должности " + Ссылка + ", необходимо выполнить проверку", "Создана/изменена должность " + Ссылка, Ссылка, Истина);
	КонецЕсли;
	
КонецПроцедуры
